run/counterFlow/constant/air/airProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Air (0.233*O2 + 0.767*N2 by mass) properties @ 1000 K

rho             rho     [1 -3 0 0 0 0 0]     0.3516;
mu              mu      [1 -1 -1 0 0 0 0]    4.336e-5;
Cp              Cp      [0 2 -2 -1 0 0 0]    1149.3;
k               k       [1 1 -3 -1 0 0 0]    0.0692;

diffusivity
{
    type        binaryFSG;
    Tname       T;
    pName       p;
    speciesA    O2;
    speciesB    N2;
    // --------------------------------------
    //type        fixedDiffusivity;
    //diff0       diff0 [0 2 -1 0 0 0 0]  1.7e-4;
}

// ************************************************************************* //
