run/counterFlow/0/fuel/p
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    fuelInlet
    {
        type            zeroGradient;
    }

    fuelOutlet
    {
        type            fixedValue;
        value           $internalField;
    }

    fuelSides
    {
        type            zeroGradient;
    }

    anodeSides
    {
        type            zeroGradient;
    }

    aflSides
    {
        type            zeroGradient;
    }
    
    fuel_to_electrolyte //anode
    {
        type            fixedGradient;
        gradient        uniform 0;
    }

    fuel_to_interconnect1
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
